import { Swiper, SwiperSlide } from "swiper/react";
import { Pagination } from "swiper/modules";
import "swiper/css";
import SlideBtns from "./miniComponents/SwipperBtn"
import "swiper/css/pagination";

export default function Swipper1() {
  return (
    <>
      <section className="py-17.5 bg-white">
        <div className="w-full max-w-[1300px] mx-auto px-4">
          <h2 className="text-black1 md:text-4xl text-3xl leading-[33px] md-10 font-bold flex justify-center items-center mb-10 md:mb-14 lg:mb-17.5">
            Отзывы
          </h2>
          <Swiper
            className="!lg:pb-14 !md:pb-[70px] !pb-[90px]"
            modules={[Pagination]}
            spaceBetween={50}
            pagination={{ clickable: true }}
            slidesPerView={1}
            onSlideChange={() => console.log("slide change")}
            onSwiper={(swiper) => console.log(swiper)}
            breakpoints={{
                1024: {
                    slidesPerView: 2.5,
                },
                768:{
                    slidesPerView: 1.5,
                },
            }}
          >
            <SwiperSlide>
              <div
                className="md:p-9 p-6 mt-5 flex items-start gap-2 bg-white rounded-lg"
                style={{ boxShadow: "0 0 25px 0 #d0d0d040" }}
              >
                <div className="md:w-7 h-9">
                  <svg
                    width={21}
                    height={23}
                    viewBox="0 0 21 23"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M3.012 22.0156C1.956 20.2636 1.248 18.4276 0.888 16.5076C0.528 14.5636 0.492 12.6436 0.78 10.7476C1.068 8.85163 1.68 7.03963 2.616 5.31163C3.576 3.58363 4.848 2.03563 6.432 0.667632L8.628 1.99963C9.012 2.26363 9.18 2.58763 9.132 2.97163C9.084 3.33163 8.952 3.63163 8.736 3.87163C8.16 4.59163 7.644 5.49163 7.188 6.57163C6.756 7.62763 6.468 8.77963 6.324 10.0276C6.18 11.2756 6.228 12.5716 6.468 13.9156C6.708 15.2596 7.212 16.5796 7.98 17.8756C8.316 18.4276 8.412 18.9196 8.268 19.3516C8.124 19.7836 7.812 20.0956 7.332 20.2876L3.012 22.0156ZM14.208 22.0156C13.152 20.2636 12.444 18.4276 12.084 16.5076C11.724 14.5636 11.688 12.6436 11.976 10.7476C12.264 8.85163 12.876 7.03963 13.812 5.31163C14.772 3.58363 16.044 2.03563 17.628 0.667632L19.824 1.99963C20.208 2.26363 20.376 2.58763 20.328 2.97163C20.28 3.33163 20.148 3.63163 19.932 3.87163C19.356 4.59163 18.84 5.49163 18.384 6.57163C17.952 7.62763 17.664 8.77963 17.52 10.0276C17.376 11.2756 17.424 12.5716 17.664 13.9156C17.904 15.2596 18.408 16.5796 19.176 17.8756C19.512 18.4276 19.608 18.9196 19.464 19.3516C19.32 19.7836 19.008 20.0956 18.528 20.2876L14.208 22.0156Z"
                      fill="#FAC663"
                    />
                  </svg>
                </div>
                <div className="flex flex-col gap-6">
                  <p className="text-black1 leading-5 text-[15px] font-medium">
                    Первый раз пришлось оставить нашего котика в гостинице,
                    очень переживали. Администратор Мария каждый день высылала
                    нам фото нашего питомца, рассказывала, как он себя
                    чувствует. И мы и котик остались очень довольны!
                  </p>
                  <div className="md:flex hidden justify-between items-center">
                    <span className="text-[#848484] text-[14px] leading-4">
                      Валерия Гришаева
                    </span>
                    <span className="text-[#848484] text-[14px] leading-4">
                      15 ноября, 2019
                    </span>
                  </div>
                </div>
              </div>
            </SwiperSlide>
            <SwiperSlide>
              <div
                className="md:p-9 p-6 mt-5 flex items-start gap-2 bg-white rounded-lg"
                style={{ boxShadow: "0 0 25px 0 #d0d0d040" }}
              >
                <div className="md:w-7 h-9">
                  <svg
                    width={21}
                    height={23}
                    viewBox="0 0 21 23"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M3.012 22.0156C1.956 20.2636 1.248 18.4276 0.888 16.5076C0.528 14.5636 0.492 12.6436 0.78 10.7476C1.068 8.85163 1.68 7.03963 2.616 5.31163C3.576 3.58363 4.848 2.03563 6.432 0.667632L8.628 1.99963C9.012 2.26363 9.18 2.58763 9.132 2.97163C9.084 3.33163 8.952 3.63163 8.736 3.87163C8.16 4.59163 7.644 5.49163 7.188 6.57163C6.756 7.62763 6.468 8.77963 6.324 10.0276C6.18 11.2756 6.228 12.5716 6.468 13.9156C6.708 15.2596 7.212 16.5796 7.98 17.8756C8.316 18.4276 8.412 18.9196 8.268 19.3516C8.124 19.7836 7.812 20.0956 7.332 20.2876L3.012 22.0156ZM14.208 22.0156C13.152 20.2636 12.444 18.4276 12.084 16.5076C11.724 14.5636 11.688 12.6436 11.976 10.7476C12.264 8.85163 12.876 7.03963 13.812 5.31163C14.772 3.58363 16.044 2.03563 17.628 0.667632L19.824 1.99963C20.208 2.26363 20.376 2.58763 20.328 2.97163C20.28 3.33163 20.148 3.63163 19.932 3.87163C19.356 4.59163 18.84 5.49163 18.384 6.57163C17.952 7.62763 17.664 8.77963 17.52 10.0276C17.376 11.2756 17.424 12.5716 17.664 13.9156C17.904 15.2596 18.408 16.5796 19.176 17.8756C19.512 18.4276 19.608 18.9196 19.464 19.3516C19.32 19.7836 19.008 20.0956 18.528 20.2876L14.208 22.0156Z"
                      fill="#FAC663"
                    />
                  </svg>
                </div>
                <div className="flex flex-col gap-6">
                  <p className="text-black1 leading-5 text-[15px] font-medium">
                    Первый раз пришлось оставить нашего котика в гостинице,
                    очень переживали. Администратор Мария каждый день высылала
                    нам фото нашего питомца, рассказывала, как он себя
                    чувствует. И мы и котик остались очень довольны!
                  </p>
                  <div className="md:flex hidden justify-between items-center">
                    <span className="text-[#848484] text-[14px] leading-4">
                      Валерия Гришаева
                    </span>
                    <span className="text-[#848484] text-[14px] leading-4">
                      15 ноября, 2019
                    </span>
                  </div>
                </div>
              </div>
            </SwiperSlide>
            <SwiperSlide>
              <div
                className="md:p-9 p-6 mt-5 flex items-start gap-2 bg-white rounded-lg"
                style={{ boxShadow: "0 0 25px 0 #d0d0d040" }}
              >
                <div className="md:w-7 h-9">
                  <svg
                    width={21}
                    height={23}
                    viewBox="0 0 21 23"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M3.012 22.0156C1.956 20.2636 1.248 18.4276 0.888 16.5076C0.528 14.5636 0.492 12.6436 0.78 10.7476C1.068 8.85163 1.68 7.03963 2.616 5.31163C3.576 3.58363 4.848 2.03563 6.432 0.667632L8.628 1.99963C9.012 2.26363 9.18 2.58763 9.132 2.97163C9.084 3.33163 8.952 3.63163 8.736 3.87163C8.16 4.59163 7.644 5.49163 7.188 6.57163C6.756 7.62763 6.468 8.77963 6.324 10.0276C6.18 11.2756 6.228 12.5716 6.468 13.9156C6.708 15.2596 7.212 16.5796 7.98 17.8756C8.316 18.4276 8.412 18.9196 8.268 19.3516C8.124 19.7836 7.812 20.0956 7.332 20.2876L3.012 22.0156ZM14.208 22.0156C13.152 20.2636 12.444 18.4276 12.084 16.5076C11.724 14.5636 11.688 12.6436 11.976 10.7476C12.264 8.85163 12.876 7.03963 13.812 5.31163C14.772 3.58363 16.044 2.03563 17.628 0.667632L19.824 1.99963C20.208 2.26363 20.376 2.58763 20.328 2.97163C20.28 3.33163 20.148 3.63163 19.932 3.87163C19.356 4.59163 18.84 5.49163 18.384 6.57163C17.952 7.62763 17.664 8.77963 17.52 10.0276C17.376 11.2756 17.424 12.5716 17.664 13.9156C17.904 15.2596 18.408 16.5796 19.176 17.8756C19.512 18.4276 19.608 18.9196 19.464 19.3516C19.32 19.7836 19.008 20.0956 18.528 20.2876L14.208 22.0156Z"
                      fill="#FAC663"
                    />
                  </svg>
                </div>
                <div className="flex flex-col gap-6">
                  <p className="text-black1 leading-5 text-[15px] font-medium">
                    Первый раз пришлось оставить нашего котика в гостинице,
                    очень переживали. Администратор Мария каждый день высылала
                    нам фото нашего питомца, рассказывала, как он себя
                    чувствует. И мы и котик остались очень довольны!
                  </p>
                  <div className="md:flex hidden justify-between items-center">
                    <span className="text-[#848484] text-[14px] leading-4">
                      Валерия Гришаева
                    </span>
                    <span className="text-[#848484] text-[14px] leading-4">
                      15 ноября, 2019
                    </span>
                  </div>
                </div>
              </div>
            </SwiperSlide>
            <SwiperSlide>
              <div
                className="md:p-9 p-6 mt-5 flex items-start gap-2 bg-white rounded-lg"
                style={{ boxShadow: "0 0 25px 0 #d0d0d040" }}
              >
                <div className="md:w-7 h-9">
                  <svg
                    width={21}
                    height={23}
                    viewBox="0 0 21 23"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M3.012 22.0156C1.956 20.2636 1.248 18.4276 0.888 16.5076C0.528 14.5636 0.492 12.6436 0.78 10.7476C1.068 8.85163 1.68 7.03963 2.616 5.31163C3.576 3.58363 4.848 2.03563 6.432 0.667632L8.628 1.99963C9.012 2.26363 9.18 2.58763 9.132 2.97163C9.084 3.33163 8.952 3.63163 8.736 3.87163C8.16 4.59163 7.644 5.49163 7.188 6.57163C6.756 7.62763 6.468 8.77963 6.324 10.0276C6.18 11.2756 6.228 12.5716 6.468 13.9156C6.708 15.2596 7.212 16.5796 7.98 17.8756C8.316 18.4276 8.412 18.9196 8.268 19.3516C8.124 19.7836 7.812 20.0956 7.332 20.2876L3.012 22.0156ZM14.208 22.0156C13.152 20.2636 12.444 18.4276 12.084 16.5076C11.724 14.5636 11.688 12.6436 11.976 10.7476C12.264 8.85163 12.876 7.03963 13.812 5.31163C14.772 3.58363 16.044 2.03563 17.628 0.667632L19.824 1.99963C20.208 2.26363 20.376 2.58763 20.328 2.97163C20.28 3.33163 20.148 3.63163 19.932 3.87163C19.356 4.59163 18.84 5.49163 18.384 6.57163C17.952 7.62763 17.664 8.77963 17.52 10.0276C17.376 11.2756 17.424 12.5716 17.664 13.9156C17.904 15.2596 18.408 16.5796 19.176 17.8756C19.512 18.4276 19.608 18.9196 19.464 19.3516C19.32 19.7836 19.008 20.0956 18.528 20.2876L14.208 22.0156Z"
                      fill="#FAC663"
                    />
                  </svg>
                </div>
                <div className="flex flex-col gap-6">
                  <p className="text-black1 leading-5 text-[15px] font-medium">
                    Первый раз пришлось оставить нашего котика в гостинице,
                    очень переживали. Администратор Мария каждый день высылала
                    нам фото нашего питомца, рассказывала, как он себя
                    чувствует. И мы и котик остались очень довольны!
                  </p>
                  <div className="md:flex hidden justify-between items-center">
                    <span className="text-[#848484] text-[14px] leading-4">
                      Валерия Гришаева
                    </span>
                    <span className="text-[#848484] text-[14px] leading-4">
                      15 ноября, 2019
                    </span>
                  </div>
                </div>
              </div>
            </SwiperSlide>
            <SwiperSlide>
              <div
                className="md:p-9 p-6 mt-5 flex items-start gap-2 bg-white rounded-lg"
                style={{ boxShadow: "0 0 25px 0 #d0d0d040" }}
              >
                <div className="md:w-7 h-9">
                  <svg
                    width={21}
                    height={23}
                    viewBox="0 0 21 23"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M3.012 22.0156C1.956 20.2636 1.248 18.4276 0.888 16.5076C0.528 14.5636 0.492 12.6436 0.78 10.7476C1.068 8.85163 1.68 7.03963 2.616 5.31163C3.576 3.58363 4.848 2.03563 6.432 0.667632L8.628 1.99963C9.012 2.26363 9.18 2.58763 9.132 2.97163C9.084 3.33163 8.952 3.63163 8.736 3.87163C8.16 4.59163 7.644 5.49163 7.188 6.57163C6.756 7.62763 6.468 8.77963 6.324 10.0276C6.18 11.2756 6.228 12.5716 6.468 13.9156C6.708 15.2596 7.212 16.5796 7.98 17.8756C8.316 18.4276 8.412 18.9196 8.268 19.3516C8.124 19.7836 7.812 20.0956 7.332 20.2876L3.012 22.0156ZM14.208 22.0156C13.152 20.2636 12.444 18.4276 12.084 16.5076C11.724 14.5636 11.688 12.6436 11.976 10.7476C12.264 8.85163 12.876 7.03963 13.812 5.31163C14.772 3.58363 16.044 2.03563 17.628 0.667632L19.824 1.99963C20.208 2.26363 20.376 2.58763 20.328 2.97163C20.28 3.33163 20.148 3.63163 19.932 3.87163C19.356 4.59163 18.84 5.49163 18.384 6.57163C17.952 7.62763 17.664 8.77963 17.52 10.0276C17.376 11.2756 17.424 12.5716 17.664 13.9156C17.904 15.2596 18.408 16.5796 19.176 17.8756C19.512 18.4276 19.608 18.9196 19.464 19.3516C19.32 19.7836 19.008 20.0956 18.528 20.2876L14.208 22.0156Z"
                      fill="#FAC663"
                    />
                  </svg>
                </div>
                <div className="flex flex-col gap-6">
                  <p className="text-black1 leading-5 text-[15px] font-medium">
                    Первый раз пришлось оставить нашего котика в гостинице,
                    очень переживали. Администратор Мария каждый день высылала
                    нам фото нашего питомца, рассказывала, как он себя
                    чувствует. И мы и котик остались очень довольны!
                  </p>
                  <div className="md:flex hidden justify-between items-center">
                    <span className="text-[#848484] text-[14px] leading-4">
                      Валерия Гришаева
                    </span>
                    <span className="text-[#848484] text-[14px] leading-4">
                      15 ноября, 2019
                    </span>
                  </div>
                </div>
              </div>
            </SwiperSlide>
            <SlideBtns/>
          </Swiper>
        </div>
      </section>
    </>
  );
}
